Tekla.Structures.Dialog.Data.MaterialTypeExtensions
The Tekla.Structures.Dialog.Data.MaterialTypeExtensions class provides a set of extension methods for Tekla.Structures.Dialog.Data.MaterialType and Tekla.Structures.Dialog.Data.Native.dotMaterialType.

Tekla.Structures.Dialog.Data.MaterialTypeExtensions.Convert(Tekla.Structures.Dialog.Data.MaterialType)
Converts an instance of Tekla.Structures.Dialog.Data.MaterialType to an instance of Tekla.Structures.Dialog.Data.Native.dotMaterialType.
materialType: The Tekla.Structures.Dialog.Data.MaterialType to convert.
Returns: The converted Tekla.Structures.Dialog.Data.Native.dotMaterialType.